PeleAB/STM32N6-FaceRecognition/Src/main.c
    /* Initialize enhanced PC streaming */
    Enhanced_PC_STREAM_Init();
    
    /* Hardware initialization */
    BSP_LED_Init(LED1);
    BSP_LED_Init(LED2);
    BSP_LED_Off(LED1);
    BSP_LED_Off(LED2);
    BSP_PB_Init(BUTTON_USER1, BUTTON_MODE_GPIO);
    
    /* Initialize neural networks centrally */
    ret = nn_init(&ctx->nn_ctx);
    if (ret < 0) {
        printf("❌ Neural network initialization failed: %d\n", ret);
        return ret;
    }
    
    /* Post-processing initialization */
    app_postprocess_init(&ctx->pp_params);
    
    return 0;
}

/**
 * @brief Process frame detections - simplified tracker-free approach
 * @param ctx Application context
 * @param boxes Detected bounding boxes
 * @param box_count Number of detected boxes
 */
static void process_frame_detections(app_context_t *ctx, pd_pp_box_t *boxes, uint32_t box_count)
{
    /* Reset frame state */
    ctx->face_detected = false;
    ctx->face_verified = false;
    ctx->current_similarity = 0.0f;
    
    /* Process detections if any found */
    if (box_count > 0) {
        /* Find box with highest confidence */
        uint32_t best_idx = 0;
        for (uint32_t i = 1; i < box_count; i++) {
            if (boxes[i].prob > boxes[best_idx].prob) {
                best_idx = i;
            }
        }
        
        ctx->best_detection = boxes[best_idx];
        ctx->face_detected = true;
        
        /* Run face recognition if confidence is high enough */
        if (ctx->best_detection.prob >= FACE_DETECTION_CONFIDENCE_THRESHOLD) {
            float similarity = verify_box(ctx, &ctx->best_detection);
            ctx->current_similarity = similarity;
            
            /* Update multi-frame decision algorithm */
            update_similarity_history(ctx, similarity);
            compute_stable_verification(ctx);
            
            /* Use smoothed similarity for display and decisions */
            float display_similarity = ctx->history_count >= 3 ? ctx->smoothed_similarity : similarity;
            ctx->best_detection.prob = display_similarity;
            
            /* Face verification based on stable multi-frame decision */
            ctx->face_verified = ctx->stable_verification;
            
            /* Update the box in the output with the smoothed similarity score */
            boxes[best_idx].prob = display_similarity;
        } else {
            /* No face recognition run - reset history for clean state */
            ctx->history_count = 0;
            ctx->history_index = 0;
            ctx->smoothed_similarity = 0.0f;
            ctx->stable_verification = false;
        }
    }
}

/**
 * @brief Update LED status based on stable verification state with timeout
 * @param ctx Application context
 */
static void update_led_status(app_context_t *ctx)
{
    uint32_t current_time = HAL_GetTick();
    
    if (ctx->stable_verification) {
        BSP_LED_On(LED2);   /* Green LED - stable face verification */
        BSP_LED_Off(LED1);
        /* Update timestamp for stable verification */
        ctx->last_stable_verification_ts = current_time;
        ctx->led_timeout_active = false;
    } else if (ctx->face_detected) {
        BSP_LED_On(LED1);   /* Red LED - face detected but not stably verified */
        BSP_LED_Off(LED2);
        ctx->led_timeout_active = false;
    } else {
        /* No face detected - check if we should maintain green LED due to recent verification */
        if (ctx->last_stable_verification_ts != 0 && 
            (current_time - ctx->last_stable_verification_ts) < FACE_UNVERIFIED_LED_TIMEOUT_MS) {
            /* Keep green LED on for timeout period after last positive recognition */
            BSP_LED_On(LED2);
            BSP_LED_Off(LED1);
            ctx->led_timeout_active = true;
        } else {
            /* Timeout expired or no previous verification - turn off both LEDs */
            BSP_LED_Off(LED1);
            BSP_LED_Off(LED2);
            ctx->led_timeout_active = false;
        }
    }
}

/**
 * @brief Clean up neural network output buffers
 * @param nn_out Array of neural network output buffers
 * @param nn_out_len Array of buffer lengths
 * @param number_output Number of outputs
 */
static void cleanup_nn_buffers(float32_t **nn_out, int32_t *nn_out_len, int number_output)
{
    for (int i = 0; i < number_output; i++) {
        SCB_InvalidateDCache_by_Addr(nn_out[i], nn_out_len[i]);
    }
}

/**
 * @brief Main application loop
 * @param ctx Application context
 */
/* Removed unused helper functions to fix compilation warnings */

/**
 * @brief Main application loop (refactored)
 * @param ctx Application context
 * @return 0 on success, negative on error
 */
static int app_main_loop(app_context_t *ctx)
{
    /* Verify NN context is initialized */
    if (!ctx->nn_ctx.networks_initialized) {
        printf("❌ Neural networks not initialized!\n");
        return -1;
    }
    uint32_t pitch_nn = 0;
    uint32_t timestamps[3] = { 0 };
    
    app_input_init(&pitch_nn);
    
    while (1) {
        /* Frame capture */
        if (app_get_frame(nn_rgb, pitch_nn) != 0) {
            continue;
        }
        
        /* Prepare input for neural network */
        img_rgb_to_chw_float(nn_rgb, (float32_t *)ctx->nn_ctx.detection_input_buffer, 
                            NN_WIDTH * NN_BPP, NN_WIDTH, NN_HEIGHT);
        SCB_CleanInvalidateDCache_by_Addr(ctx->nn_ctx.detection_input_buffer, 
                                         ctx->nn_ctx.detection_input_length);
        
        /* Run face detection */
        timestamps[0] = HAL_GetTick();
        RunNetworkSync(&NN_Instance_face_detection);
        LL_ATON_RT_DeInit_Network(&NN_Instance_face_detection);
        
        /* Post-processing */
        int32_t ret = app_postprocess_run((void **) ctx->nn_ctx.detection_output_buffers, 
                                         ctx->nn_ctx.detection_output_count, 
                                         &ctx->pp_output, &ctx->pp_params);
        if (ret != 0) {
            continue;
        }
        
