PeleAB/STM32N6-FaceRecognition/Src/main.c
        /* Process detection results - simplified approach */
        pd_pp_box_t *boxes = (pd_pp_box_t *)ctx->pp_output.pOutData;
        process_frame_detections(ctx, boxes, ctx->pp_output.box_nb);
        
        /* Update system status */
        update_led_status(ctx);
        
        /* Update performance metrics */
        timestamps[1] = HAL_GetTick();
        if (timestamps[2] == 0) {
            timestamps[2] = HAL_GetTick();
        }
        
        ctx->frame_count++;
        ctx->performance.fps = 1000.0f / (timestamps[1] - timestamps[0] + 1);
        ctx->performance.inference_time_ms = timestamps[1] - timestamps[0];
        ctx->performance.frame_count = ctx->frame_count;
        ctx->performance.detection_count = ctx->pp_output.box_nb;
        
        /* Send heartbeat periodically */
        Enhanced_PC_STREAM_SendHeartbeat();
        
        app_output(&ctx->pp_output, timestamps[1] - timestamps[0], timestamps[2], ctx);
        handle_user_button(ctx);
        
        /* Clean up buffers */
        cleanup_nn_buffers(ctx->nn_ctx.detection_output_buffers, 
                          ctx->nn_ctx.detection_output_lengths, 
                          ctx->nn_ctx.detection_output_count);
    }
    
    return 0;
}

/**
 * @brief Main program entry point
 * @return Never returns (0 on theoretical exit)
 */
int main(void)
{
    int ret = app_init(&g_app_ctx);
    if (ret < 0) {
        /* Initialization failed - handle error */
        while (1) {
            BSP_LED_On(LED1);  /* Red LED indicates error */
            HAL_Delay(100);
            BSP_LED_Off(LED1);
            HAL_Delay(100);
        }
    }
    
    /* Start main application loop */
    ret = app_main_loop(&g_app_ctx);
    
    /* Cleanup neural networks (never reached in normal operation) */
    nn_cleanup(&g_app_ctx.nn_ctx);
    
    (void)ret; /* Suppress unused variable warning */
    return 0; /* Never reached */
}


void HAL_CACHEAXI_MspInit(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  __HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();
  __HAL_RCC_CACHEAXI_CLK_ENABLE();
  __HAL_RCC_CACHEAXI_FORCE_RESET();
  __HAL_RCC_CACHEAXI_RELEASE_RESET();
}

void HAL_CACHEAXI_MspDeInit(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  __HAL_RCC_CACHEAXIRAM_MEM_CLK_DISABLE();
  __HAL_RCC_CACHEAXI_CLK_DISABLE();
  __HAL_RCC_CACHEAXI_FORCE_RESET();
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  UNUSED(file);
  UNUSED(line);
  __BKPT(0);
  while (1)
  {
  }
}

#endif
